espressif/esp-idf/components/soc/esp32h21/register/soc/gdma_struct.h
/** Type of out_dscr_chn register
 *  Current inlink descriptor address of Tx channel n.
 */
typedef union {
    struct {
        /** outlink_dscr_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the current outlink descriptor y.
         */
        uint32_t outlink_dscr_chn:32;
    };
    uint32_t val;
} gdma_out_dscr_chn_reg_t;

/** Type of out_dscr_bf0_chn register
 *  The last inlink descriptor address of Tx channel n.
 */
typedef union {
    struct {
        /** outlink_dscr_bf0_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the last outlink descriptor y-1.
         */
        uint32_t outlink_dscr_bf0_chn:32;
    };
    uint32_t val;
} gdma_out_dscr_bf0_chn_reg_t;

/** Type of out_dscr_bf1_chn register
 *  The second-to-last inlink descriptor address of Tx channel n.
 */
typedef union {
    struct {
        /** outlink_dscr_bf1_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the second-to-last inlink descriptor x-2.
         */
        uint32_t outlink_dscr_bf1_chn:32;
    };
    uint32_t val;
} gdma_out_dscr_bf1_chn_reg_t;


/** Group: Priority Registers */
/** Type of in_pri_chn register
 *  Priority register of Rx channel n.
 */
typedef union {
    struct {
        /** rx_pri_chn : R/W; bitpos: [3:0]; default: 0;
         *  The priority of Rx channel n. The larger of the value the higher of the priority.
         */
        uint32_t rx_pri_chn:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} gdma_in_pri_chn_reg_t;

/** Type of out_pri_chn register
 *  Priority register of Tx channel n.
 */
typedef union {
    struct {
        /** tx_pri_chn : R/W; bitpos: [3:0]; default: 0;
         *  The priority of Tx channel n. The larger of the value the higher of the priority.
         */
        uint32_t tx_pri_chn:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} gdma_out_pri_chn_reg_t;


/** Group: Peripheral Select Registers */
/** Type of in_peri_sel_chn register
 *  Peripheral selection of Rx channel n.
 */
typedef union {
    struct {
        /** peri_in_sel_chn : R/W; bitpos: [5:0]; default: 63;
         *  This register is used to select peripheral for Rx channel n. 0:SPI2. 1: Dummy. 2:
         *  UHCI0. 3: I2S0. 4: Dummy. 5: Dummy. 6: AES. 7: SHA. 8: ADC_DAC. 9: Parallel_IO.
         *  10~15: Dummy
         */
        uint32_t peri_in_sel_chn:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} gdma_in_peri_sel_chn_reg_t;

/** Type of out_peri_sel_chn register
 *  Peripheral selection of Tx channel n.
 */
typedef union {
    struct {
        /** peri_out_sel_chn : R/W; bitpos: [5:0]; default: 63;
         *  This register is used to select peripheral for Tx channel n. 0:SPI2. 1: Dummy. 2:
         *  UHCI0. 3: I2S0. 4: Dummy. 5: Dummy. 6: AES. 7: SHA. 8: ADC_DAC. 9: Parallel_IO.
         *  10~15: Dummy
         */
        uint32_t peri_out_sel_chn:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} gdma_out_peri_sel_chn_reg_t;


typedef struct {
    volatile gdma_in_int_raw_chn_reg_t in_int_raw_ch0;
    volatile gdma_in_int_st_chn_reg_t in_int_st_ch0;
    volatile gdma_in_int_ena_chn_reg_t in_int_ena_ch0;
    volatile gdma_in_int_clr_chn_reg_t in_int_clr_ch0;
    volatile gdma_in_int_raw_chn_reg_t in_int_raw_ch1;
    volatile gdma_in_int_st_chn_reg_t in_int_st_ch1;
    volatile gdma_in_int_ena_chn_reg_t in_int_ena_ch1;
    volatile gdma_in_int_clr_chn_reg_t in_int_clr_ch1;
    volatile gdma_in_int_raw_chn_reg_t in_int_raw_ch2;
    volatile gdma_in_int_st_chn_reg_t in_int_st_ch2;
    volatile gdma_in_int_ena_chn_reg_t in_int_ena_ch2;
    volatile gdma_in_int_clr_chn_reg_t in_int_clr_ch2;
    volatile gdma_out_int_raw_chn_reg_t out_int_raw_ch0;
    volatile gdma_out_int_st_chn_reg_t out_int_st_ch0;
    volatile gdma_out_int_ena_chn_reg_t out_int_ena_ch0;
    volatile gdma_out_int_clr_chn_reg_t out_int_clr_ch0;
    volatile gdma_out_int_raw_chn_reg_t out_int_raw_ch1;
    volatile gdma_out_int_st_chn_reg_t out_int_st_ch1;
    volatile gdma_out_int_ena_chn_reg_t out_int_ena_ch1;
    volatile gdma_out_int_clr_chn_reg_t out_int_clr_ch1;
    volatile gdma_out_int_raw_chn_reg_t out_int_raw_ch2;
    volatile gdma_out_int_st_chn_reg_t out_int_st_ch2;
    volatile gdma_out_int_ena_chn_reg_t out_int_ena_ch2;
    volatile gdma_out_int_clr_chn_reg_t out_int_clr_ch2;
    volatile gdma_ahb_test_reg_t ahb_test;
    volatile gdma_misc_conf_reg_t misc_conf;
    volatile gdma_date_reg_t date;
    uint32_t reserved_06c;
    volatile gdma_in_conf0_chn_reg_t in_conf0_ch0;
    volatile gdma_in_conf1_chn_reg_t in_conf1_ch0;
    volatile gdma_infifo_status_chn_reg_t infifo_status_ch0;
    volatile gdma_in_pop_chn_reg_t in_pop_ch0;
    volatile gdma_in_link_chn_reg_t in_link_ch0;
    volatile gdma_in_state_chn_reg_t in_state_ch0;
    volatile gdma_in_suc_eof_des_addr_chn_reg_t in_suc_eof_des_addr_ch0;
    volatile gdma_in_err_eof_des_addr_chn_reg_t in_err_eof_des_addr_ch0;
    volatile gdma_in_dscr_chn_reg_t in_dscr_ch0;
    volatile gdma_in_dscr_bf0_chn_reg_t in_dscr_bf0_ch0;
    volatile gdma_in_dscr_bf1_chn_reg_t in_dscr_bf1_ch0;
    volatile gdma_in_pri_chn_reg_t in_pri_ch0;
    volatile gdma_in_peri_sel_chn_reg_t in_peri_sel_ch0;
    uint32_t reserved_0a4[11];
    volatile gdma_out_conf0_ch0_reg_t out_conf0_ch0;
    volatile gdma_out_conf1_chn_reg_t out_conf1_ch0;
    volatile gdma_outfifo_status_chn_reg_t outfifo_status_ch0;
    volatile gdma_out_push_chn_reg_t out_push_ch0;
    volatile gdma_out_link_chn_reg_t out_link_ch0;
    volatile gdma_out_state_chn_reg_t out_state_ch0;
    volatile gdma_out_eof_des_addr_chn_reg_t out_eof_des_addr_ch0;
    volatile gdma_out_eof_bfr_des_addr_chn_reg_t out_eof_bfr_des_addr_ch0;
    volatile gdma_out_dscr_chn_reg_t out_dscr_ch0;
    volatile gdma_out_dscr_bf0_chn_reg_t out_dscr_bf0_ch0;
    volatile gdma_out_dscr_bf1_chn_reg_t out_dscr_bf1_ch0;
    volatile gdma_out_pri_chn_reg_t out_pri_ch0;
    volatile gdma_out_peri_sel_chn_reg_t out_peri_sel_ch0;
    uint32_t reserved_104[11];
    volatile gdma_in_conf0_chn_reg_t in_conf0_ch1;
    volatile gdma_in_conf1_chn_reg_t in_conf1_ch1;
    volatile gdma_infifo_status_chn_reg_t infifo_status_ch1;
    volatile gdma_in_pop_chn_reg_t in_pop_ch1;
    volatile gdma_in_link_chn_reg_t in_link_ch1;
    volatile gdma_in_state_chn_reg_t in_state_ch1;
    volatile gdma_in_suc_eof_des_addr_chn_reg_t in_suc_eof_des_addr_ch1;
    volatile gdma_in_err_eof_des_addr_chn_reg_t in_err_eof_des_addr_ch1;
    volatile gdma_in_dscr_chn_reg_t in_dscr_ch1;
    volatile gdma_in_dscr_bf0_chn_reg_t in_dscr_bf0_ch1;
    volatile gdma_in_dscr_bf1_chn_reg_t in_dscr_bf1_ch1;
    volatile gdma_in_pri_chn_reg_t in_pri_ch1;
    volatile gdma_in_peri_sel_chn_reg_t in_peri_sel_ch1;
    uint32_t reserved_164[11];
    volatile gdma_out_conf0_chn_reg_t out_conf0_ch1;
    volatile gdma_out_conf1_chn_reg_t out_conf1_ch1;
    volatile gdma_outfifo_status_chn_reg_t outfifo_status_ch1;
    volatile gdma_out_push_chn_reg_t out_push_ch1;
    volatile gdma_out_link_chn_reg_t out_link_ch1;
    volatile gdma_out_state_chn_reg_t out_state_ch1;
    volatile gdma_out_eof_des_addr_chn_reg_t out_eof_des_addr_ch1;
    volatile gdma_out_eof_bfr_des_addr_chn_reg_t out_eof_bfr_des_addr_ch1;
    volatile gdma_out_dscr_chn_reg_t out_dscr_ch1;
    volatile gdma_out_dscr_bf0_chn_reg_t out_dscr_bf0_ch1;
    volatile gdma_out_dscr_bf1_chn_reg_t out_dscr_bf1_ch1;
    volatile gdma_out_pri_chn_reg_t out_pri_ch1;
    volatile gdma_out_peri_sel_chn_reg_t out_peri_sel_ch1;
    uint32_t reserved_1c4[11];
    volatile gdma_in_conf0_chn_reg_t in_conf0_ch2;
    volatile gdma_in_conf1_chn_reg_t in_conf1_ch2;
    volatile gdma_infifo_status_chn_reg_t infifo_status_ch2;
    volatile gdma_in_pop_chn_reg_t in_pop_ch2;
    volatile gdma_in_link_chn_reg_t in_link_ch2;
    volatile gdma_in_state_chn_reg_t in_state_ch2;
    volatile gdma_in_suc_eof_des_addr_chn_reg_t in_suc_eof_des_addr_ch2;
    volatile gdma_in_err_eof_des_addr_chn_reg_t in_err_eof_des_addr_ch2;
    volatile gdma_in_dscr_chn_reg_t in_dscr_ch2;
    volatile gdma_in_dscr_bf0_chn_reg_t in_dscr_bf0_ch2;
    volatile gdma_in_dscr_bf1_chn_reg_t in_dscr_bf1_ch2;
    volatile gdma_in_pri_chn_reg_t in_pri_ch2;
    volatile gdma_in_peri_sel_chn_reg_t in_peri_sel_ch2;
    uint32_t reserved_224[11];
    volatile gdma_out_conf0_chn_reg_t out_conf0_ch2;
    volatile gdma_out_conf1_chn_reg_t out_conf1_ch2;
    volatile gdma_outfifo_status_chn_reg_t outfifo_status_ch2;
    volatile gdma_out_push_chn_reg_t out_push_ch2;
    volatile gdma_out_link_chn_reg_t out_link_ch2;
    volatile gdma_out_state_chn_reg_t out_state_ch2;
    volatile gdma_out_eof_des_addr_chn_reg_t out_eof_des_addr_ch2;
    volatile gdma_out_eof_bfr_des_addr_chn_reg_t out_eof_bfr_des_addr_ch2;
    volatile gdma_out_dscr_chn_reg_t out_dscr_ch2;
    volatile gdma_out_dscr_bf0_chn_reg_t out_dscr_bf0_ch2;
    volatile gdma_out_dscr_bf1_chn_reg_t out_dscr_bf1_ch2;
    volatile gdma_out_pri_chn_reg_t out_pri_ch2;
    volatile gdma_out_peri_sel_chn_reg_t out_peri_sel_ch2;
} gdma_dev_t;

extern gdma_dev_t GDMA;

#ifndef __cplusplus
_Static_assert(sizeof(gdma_dev_t) == 0x284, "Invalid size of gdma_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
